cask_args appdir: '/Applications'

# Development 
brew 'wget'
brew 'git'
brew 'git-lfs'
brew 'asciinema'
brew 'tmux'
brew 'neovim'
brew 'redis'
brew 'tree'
brew 'ripgrep'
brew 'z'
brew 'gcc'
brew 'fd'
brew 'fx'
brew 'eza'
brew 'lazygit'
brew 'asdf'
brew 'gpg'
brew 'gawk'
brew 'vips'
brew 'flyctl'
brew 'starship'
brew 'tree-sitter'
brew 'difftastic'
brew 'imagemagick'
brew 'ffmpeg'
brew 'navi'
brew 'bottom'

# Apps
tap 'homebrew/cask'

cask 'firefox'
cask 'google-chrome'
cask 'arc'

cask 'alacritty'
cask 'visual-studio-code'
cask 'sourcetree'
cask 'beekeeper-studio'
cask 'dbngin'
cask 'bruno'

cask 'blender'
cask 'inkscape'
cask 'figma'
cask 'tiled'

cask 'dropbox'
cask 'skype'
cask 'microsoft-teams'
cask 'discord'

cask 'rectangle'
cask 'karabiner-elements'
cask 'raycast'
cask 'powershell'
cask 'betterdisplay'
cask 'nordvpn'
cask 'pika'
cask 'calibre'

# Others
tap 'homebrew/cask-fonts'

cask 'font-victor-mono'
cask 'font-victor-mono-nerd-font'