cask_args appdir: '/Applications'

# Development 
brew 'wget'
brew 'git'
brew 'git-lfs'
brew 'asciinema'
brew 'tmux'
brew 'neovim'
brew 'redis'
brew 'tree'
brew 'ripgrep'
brew 'z'
brew 'gcc'
brew 'fd'
brew 'exa'
brew 'lazygit'
brew 'asdf'
brew 'gpg'
brew 'gawk'
brew 'vips'
brew 'flyctl'
brew 'starship'
brew 'lua-language-server'
brew 'tree-sitter'
brew 'fig'
brew 'difftastic'

# Apps
tap 'homebrew/cask'

cask 'firefox'
cask 'google-chrome'
cask 'arc'

cask 'wezterm'
cask 'alacritty'
cask 'visual-studio-code'
cask 'sourcetree'
cask 'beekeeper-studio'
cask 'insomnia'
cask 'fig'

cask 'blender'
cask 'inkscape'
cask 'figma'
cask 'protopie'

cask 'dropbox'
cask 'skype'
cask 'slack'
cask 'discord'

cask 'rectangle'
cask 'karabiner-elements'
cask 'raycast'
cask 'powershell'
cask 'betterdisplay'
cask 'nordvpn'
cask 'pika'

# Others
tap 'homebrew/cask-fonts'

cask 'font-iosevka'
cask 'font-iosevka-nerd-font'
cask 'font-victor-mono'
cask 'font-victor-mono-nerd-font'