cask_args appdir: '/Applications'

# Development
brew 'wget'
brew 'git'
brew 'git-lfs'
brew 'asciinema'
brew 'asdf'
brew 'redis'
brew 'tree'
brew 'gcc'
brew 'fx'
brew 'gpg'
brew 'gawk'
brew 'vips'
brew 'flyctl'
brew 'ffmpeg'
brew 'sevenzip'
brew 'jq'
brew 'poppler'
brew 'fd'
brew 'ripgrep'
brew 'fzf'
brew 'imagemagick'

# System
brew 'bottom'
brew 'fastfetch'

# Terminal
brew 'tmux'
brew 'helix'
brew 'neovim'
brew 'lazygit'
brew 'starship'
brew 'difftastic'
brew 'zoxide'
brew 'yazi'

# Language Server Protocol
brew 'tree-sitter'
brew 'biome'
brew 'elixir-ls'
brew 'taplo'
brew 'vscode-langservers-extracted'

# Apps
tap 'homebrew/cask'

cask 'zen-browser'
cask 'firefox'
cask 'google-chrome'

cask 'alacritty'
cask 'beekeeper-studio'
cask 'bruno'
cask 'dbngin'

# cask 'trae'
# cask 'windsurf'

cask 'blender'
cask 'inkscape'
cask 'figma'
cask 'spline'
cask 'tiled'
cask 'darktable'

cask 'dropbox'
cask 'microsoft-teams'
cask 'discord'

cask 'rectangle'
cask 'karabiner-elements'
cask 'raycast'
cask 'powershell'
cask 'betterdisplay'
cask 'nordvpn'
cask 'pika'
cask 'calibre'
cask 'espanso'

cask 'msty'

cask 'the-unarchiver'

# Others
tap 'homebrew/cask-fonts'

cask 'font-victor-mono'
cask 'font-victor-mono-nerd-font'
cask 'font-symbols-only-nerd-font'
